Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: མིག་འཕྲུལ་འདྲ་བའི་བྱེ་བྲག་གཞི་མཁས་ཁྱོད། །
en: {129} “You will be wise in the different aspects of the net of illusions.

source: ཞིང་གི་དྲ་བའི་བྱེ་བྲག་ཇི་སྙེད་གཞི། །སེར་བུ་མཁའ་ལ་ཆགས་པ་མེད་པ་ལྟར། །རིང་པོར་མི་ཐོགས་རྒྱས་པར་འགེངས་པར་འགྱུར། །
en: Before long you will pervade completely, Like hail falling without impediment from the sky, As many of the different surfaces of the net of realms as there are.

source: ཆོས་དབྱིངས་འབྱམ་ཀླས་ཁོང་དུ་ཆུད་པར་འགྱུར། །འབྱམ་ཀླས་འཇིག་རྟེན་ཁམས་སུ་འགྲོ་བར་འགྱུར། །དུས་གསུམ་གཤེགས་པའི་སངས་རྒྱས་འབྱམ་ཀླས་ཀུན། །མཐོང་བར་འགྱུར་གྱིས་ནོར་བཟངས་དགའ་བར་གྱིས། །
en: {130} “You will comprehend the vast extent of the realm of phenomena, You will go to the vast extent of world realms, And you will see the vast extent of the buddhas in the three times; Therefore, Sudhana, be happy!

source: ཁྱོད་ཀྱིས་དེ་འདྲའི་རྣམ་ཐར་དེ་ལྟ་བུ། །མཐོང་ལ་མཐོང་ཞིང་ད་དུང་མཐོང་བར་འགྱུར། །
en: {131} “You have seen these kinds of liberation, Are seeing them, and will still see them.

source: དེ་བས་མཁས་པ་སྐྱོ་བར་མ་བྱེད་ཅིག །དགའ་ཡངས་ཟང་ཟིང་མེད་པ་ཉམས་སུ་ལོང་། །
en: Therefore, Sudhana, do not be saddened But be happy and free from worries.

source: ནོར་བཟངས་ཁྱོད་ནི་ཡོན་ཏན་སྣོད་བཟང་སྟེ། །
en: {132} “Sudhana. you are an excellent vessel for good qualities.

source: ཁྱོད་ནི་རྒྱལ་བ་རྣམས་ཀྱི་གདམས་ངག་མཐུན། །
en: You accord with the instructions of the jinas.

source: ཁྱོད་ཀྱིས་ཚུལ་འདི་ཡོངས་སུ་གཟུང་བར་ནུས། །
en: You have the ability to keep to this way.

source: དེ་བས་རྣམ་པར་འཕྲུལ་པ་འདི་དག་མཐོང་། །
en: That is why you see these miraculous manifestations.

source: སངས་རྒྱས་སྲས་པོ་གནས་མེད་སྤྱོད་ཡུལ་ཅན། །གང་རྣམས་མཐོང་བར་བསྐལ་པ་ཁྲག་ཁྲིག་དུ། །ཤིན་ཏུ་དགའ་ན་ལེགས་བརྗོད་མི་སྨོས་པ། །དེ་དག་སྤྱོད་ལེགས་སྤྱོད་ཚེ་ཁྱོད་ཀྱིས་མཐོང་། །
en: {133} “Sons of the buddhas who have the conduct without location Are indescribable and very difficult to ever see, Even during a hundred billion kalpas, but you Have seen their conduct at the time of their excellent conduct.

source: དེ་ལྟར་འཇམ་དཔལ་མངོན་དུ་མཐོང་གྱུར་ཏེ། །དེ་འདྲའི་ཡོན་ཏན་སྣོད་དུ་གྱུར་བྱས་པ། །ཁྱོད་ཀྱིས་ཐོབ་པ་རྒྱ་ཆ་བསམ་མི་ཁྱབ། །
en: {134} “In that way, you have directly perceived Mañjuśrī, And having become such a vessel for good qualities, Your attainment is vast and inconceivable.

source: མི་ཡི་སྲིད་པར་ཁྱོད་ནི་ལེགས་པར་འོངས། །
en: You who have become a human are welcome!

source: ངན་སོང་ལམ་རྣམས་ཐམས་ཅད་རྣམ་པར་ཟློག །
en: {135} “You have turned away from all paths to the lower existences.

source: མི་ཁོམ་ངན་འགྲོ་ཐམས་ཅད་རྣམ་པར་སྦྱངས། །
en: You have been purified of all inopportune, unfortunate existences.

source: སྡུག་བསྔལ་ཆོས་རྣམས་ཁྱོད་ཀྱིས་ཐམས་ཅད་བོར། །མི་དགའ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བར་གྱིས། །
en: You have cast away all the qualities of suffering, So cast aside all unhappiness.

source: བྱིས་པའི་ས་ནི་ཁྱོད་ཀྱིས་རྣམ་པར་ཟློག། །
en: {139} “You have turned away from the level of foolish beings.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ས་ལ་གནས། །
en: You are established on the level of bodhisattva qualities.

source: ཡེ་ཤེས་ས་ཡི་དམ་པ་ཡོངས་བསྐང་ཞིང་། །སངས་རྒྱས་སར་བ་རིང་པོར་མི་ཐོགས་ཐོབ། །
en: You have filled the supreme level of wisdom, And you will soon attain the level of a buddha.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་སྟེང་། །སངས་རྒྱས་ཡེ་ཤེས་ནམ་མཁའི་མཛོད་དང་མཚུངས། །དེ་ཡི་ཚད་ཀྱི་སྨོན་ལམ་གང་ཆེན་མཚོ། །ཁྱོད་ཀྱིས་བཙལ་ཟིན་ཤིན་ཏུ་དགའ་བར་གྱིས། །
en: {137} “You should be happy, for you have attained All the oceans of bodhisattva conduct, The wisdom of the buddhas, which is like the treasure of space, And the corresponding extent of the ocean of prayers.

source: དེ་ལྟར་དབང་པོ་ཡོངས་སུ་མི་སྐྱོ་ལ། །བསམ་པ་བརྟན་ཞིང་སྦྱོར་བ་ངེས་པ་རྣམས། །གང་དག་འདི་འདྲའི་བཤེས་གཉེན་བསྟེན་བྱེད་པ། །དེ་དག་རིང་བོར་མི་ཐོགས་མགོན་པོར་འགྱུར། །
en: {138} “Those who thus have unwearying powers, Strong aspiration, and definite practice And rely on these kinds of kalyāṇamitras Will become leaders before long.

source: ཁྱོད་ཀྱི་བྱང་ཆུབ་སྤྱོད་པ་སྣ་ཚོགས་ཀྱིས། །སེམས་ཅན་མང་པོ་དུལ་བར་གྱུར་མཐོང་ཞིང་། །
en: {139} “You have seen many beings being guided By a variety of bodhisattva conducts.

source: ཆོས་ཀུན་སྒོ་ཡི་བྱང་ཆུབ་སྤྱོད་པ་ལ། །
en: You should not develop any doubts concerning Bodhisattva activity that is the gateway to all Dharmas.

source: ནམ་ཡང་ཡིད་གཉིས་བྱེད་པར་མ་གྱུར་ཅིག །
en: {140} “Your perfection of merit is inconceivable.

source: དེ་ལྟར་ཕུན་སུམ་ཚོགས་པ་འདི་འདྲ་འདི། །
en: You have perfect benefit, Dharma qualities, and faith.

source: སངས་རྒྱས་སྲས་པོ་དེ་རིང་འདིར་མཐོང་བ། །དོན་ཆོས་ཡོན་ཏན་དང་བ་ཕུན་སུམ་ཚོགས། །
en: Because of that, today, here, son of the buddhas, You are seeing this kind of perfection.

source: ཁྱོད་ཀྱི་བསོད་ནམས་ཕུན་ལྡན་བསམ་མི་ཁྱབ། །དེ་ལྟར་རྒྱལ་སྲས་རྣམས་ཀྱི་རྒྱུན་འབྲེལ་བར། །རང་རང་སོ་སོའི་སྨོན་ལམ་བསྟན་བྱས་ཏེ། །ཁྱོད་ཀྱི་དེ་དག་མ་ལུས་མཐུན་རྟོགས་པ། །ཁྱོད་མཐོང་ཐོབ་པ་ཆེན་པོ་ཅི་འདྲ་ལྟོས། །
en: {141} “Look at the great attainment of yours In seeing this continuous succession of jinaputras, Each one revealing to you their individual prayers, And you comprehend them all accordingly.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྣོད་གྱུར་པ། །དེ་འདྲའི་སྲིད་པ་བརྒྱར་ཡང་དཀོན་པས་ན། །
en: {142} “Even in a hundred existences it is difficult To find such a vessel for bodhisattva conduct as you.

source: དེ་ཕྱིར་རྒྱལ་སྲས་དེ་དག་རྒྱུན་འབྲེལ་བར། །ཁྱོད་ལ་རྣམ་ཐར་ཚུལ་རྣམས་ཡོངས་སུ་སྟོན། །
en: Therefore, the jinaputras in continuous succession Teach you the ways of the liberations.

source: བསྐལ་བ་ཁྲག་ཁྲིག་བྱེ་བར་འགྲོ་བ་གང་། །བདེ་གཤེགས་སྲས་དང་ལྷན་ཅིག་འགྲོགས་གྱུར་པ། །དེ་དག་དེ་རྣམས་སྤྱོད་ཡུལ་མི་ཤེས་ཏེ། །དེ་དག་ཡོན་ཏན་སྣོད་དུ་བདག་མ་བྱས། །
en: {143} “Those beings who during a quintillion kalpas Have been in the company of sons of the sugatas Without knowing their field of activity Cannot themselves be vessels for the good qualities.

source: ཁྱོད་ཀྱིས་འདི་འདྲའི་ཚུལ་འདི་ཐོས་པར་འགྱུར། །བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་འཕྲུལ་བ། །འགྲོ་བ་ཀུན་ན་དཀོན་པ་ཁྱོད་ཀྱིས་མཐོང་། །དེ་ལྟར་ནོར་བཟངས་དགའ་བའི་ཡིད་དུ་གྱིས། །
en: {144} “You have heard these kinds of ways, And you have seen the miraculous manifestations Of great bodhisattvas, which are rare in the world; Therefore, Sudhana, have a happy mind!

source: ཁྱོད་ལ་སངས་རྒྱས་ཐམས་ཅད་དགོངས་པ་མཛད། །
en: {145} “All of the buddhas pay heed to you.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱོད་གཟུང་ཕྱིར་ཡང་གནས། །ཁྱོད་ཀྱང་དེ་དག་རྗེས་སུ་བསྟན་ལ་གནས། །
en: All the bodhisattvas remain caring for you, And you are established in their teaching.

source: ལེགས་སོ་ནོར་བཟངས་ཁྱོད་ཀྱི་འཚོ་བ་དགེ །
en: Well done, Sudhana, you have a good life!

source: བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཀྱི་ཆོས་ལ་གནས། །
en: {146} “You dwell within the family of the bodhisattvas.

source: ཁྱོད་ནི་རྒྱལ་སྲས་ཡོན་ཏན་རྣམས་ལ་སློབ། །
en: You train in the qualities of the jinaputras.

source: བདེ་བར་གཤེགས་རིགས་རྣམ་པར་འཕེལ་བྱེད་འགྱུར། །
en: You will increase the lineage of the sugatas.

source: ནོར་བཟངས་དགའ་བ་རྒྱ་ཆེན་ཉམས་སུ་ལོང་། །
en: Sudhana, you should experience the highest joy!

source: སངས་རྒྱས་མཉམ་མེད་ཐམས་ཅད་ཁྱོད་ཀྱི་ཕ། །
en: {147} “All the unequaled buddhas are your fathers.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཁྱོད་དང་སྤུན། །
en: All the bodhisattvas are your brothers.

source: བྱང་ཆུབ་ཡན་ལག་ཐམས་ཅད་ཁྱོད་ཀྱི་གཉེན། །
en: All the aspects of enlightenment are your relatives.

source: ཁྱོད་ནི་བདེ་གཤེགས་ཐུགས་ལས་སྐྱེས་པའི་སྲས། །
en: You are a son born from the heart of the sugatas.

source: ཆོས་ཀྱི་རྒྱལ་པོ་རིག་པའི་རྒྱུད་འཛིན་པ། །
en: {148} “You are a holder of the family lineage of the king of Dharma.

source: བྱང་ཆུབ་སེམས་དཔའི་རིགས་རྒྱུད་འཕེལ་བར་བྱེད། །
en: You increase the family lineage of the bodhisattvas.

source: རིང་པོར་མི་ཐོགས་ཆོས་རྒྱལ་ཐོབ་འགྱུར་གྱིས། །
en: Before long you will become a king of the Dharma.

source: ནོར་བཟངས་དབང་པོ་ཚིམ་ཞིང་དགའ་བར་གྱིས། །
en: Sudhana, be happy, with satisfied senses.

source: སངས་རྒྱས་ཀུན་གྱི་དབང་བསྐུར་དམ་པ་ཡང་། །རིང་པོར་མི་ཐོགས་རྨད་བྱུང་ཐོབ་པར་འགྱུར། །
en: {149} “Before long you will attain the wonderful, Supreme consecration from all the buddhas.

source: རྒྱལ་བའི་སྲས་དང་མཚུངས་ཤིང་མཉམ་པར་འགྱུར། །ཁྱོད་ཀྱི་སྤྱོད་པའི་ཚུལ་མཐུན་དེ་འདྲའོ། །
en: You will become the same as and equal to the bodhisattvas, And your conduct will also be the same in that way.

source: མི་གང་ཅི་འདྲའི་ས་བོན་འདེབས་བྱེད་པ། །དེ་ནི་དེ་འདྲའི་འབྲས་བུ་ཐོབ་པར་འགྱུར། །
en: {150} “Whatever kinds of seeds are planted by humans, They will gain the corresponding results.

source: དགའ་བ་རྒྱ་ཆེན་བསམ་ཡས་ཉམས་སུ་ལོང་། །ངས་ནི་དེ་རིང་ཁྱོད་ཀྱི་དབུགས་ཀྱང་དབྱུང་། །
en: You should experience an inconceivable, vast joy, For today I am giving you my reassurance.

source: ཚེ་གཅིག་ཁྱོད་ཀྱིས་གང་རྣམས་ཐོབ་གྱུར་པ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་བསམ་ཡས་པ། །བསྐལ་བ་ཁྲག་ཁྲིག་བྱང་ཆུབ་སྤྱད་སྤྱོད་པ། །དེ་དག་གིས་ཀྱང་ཕུན་སུམ་འདི་མ་རྙེད། །
en: {151} “That which you have attained in one lifetime Is a perfection that has not been obtained By countless billions of bodhisattvas Practicing bodhisattva conduct in billions of kalpas.

source: འདི་རྣམས་ཐམས་ཅད་མོས་པའི་འབྲས་བུ་སྟེ། །བརྩོན་འགྲུས་བསམ་པ་དག་ནི་དེ་བཞིན་ནོ། །གང་ཞིག་སྤྱོད་པ་འདི་འདྲ་དཀའ་བ་ཡང་། །ནོར་བཟངས་སྤྱོད་པ་གང་ཡིན་དེ་ལ་སྤྱོད། །
en: {152} “Whoever delights in this conduct In all these results that are aspired to, And similarly in its diligence and motivation, Should practice Sudhana’s conduct.

source: སྤྱོད་པ་ཐམས་ཅད་སྨོན་ལམ་བྱུང་བ་ཡིན། །
en: {153} “All conduct originates from prayer.

source: ཆོས་རྣམས་ཐམས་ཅད་མོས་ལས་ཡོངས་སུ་བྱུང་། །
en: All Dharma originates from aspiration.

source: ནོར་བཟངས་དེ་ལྟར་ཁྱོད་ཀྱིས་ཡོངས་སུ་བསྒྲུབས། །
en: Sudhana, this has been accomplished by you.

source: རྟག་ཏུ་ཁྱད་པར་སྤྱོད་པ་བཙལ་བར་གྱིས། །
en: Always pursue this supreme conduct!

source: ཀླུ་ཡི་བསམ་པ་ཇི་སྙེད་བྱུང་གྱུར་པ། །དེ་སྙེད་ཆར་པ་ཡོངས་སུ་འབབ་པར་འགྱུར། །
en: {154} “To the extent that the nāgas have the intention, To that extent there will come rainfall.

source: སྨོན་ལམ་ཡེ་ཤེས་སྤྱོད་ཡུལ་ཇི་སྙེད་པ། །དེ་སྙེད་བྱང་ཆུབ་སྤྱོད་པས་རྒྱས་པར་འགྱུར། །
en: To the extent that there is the field of activity of the wisdom of prayers, To that extent spreads the conduct of a bodhisattva.

source: ནོར་བཟངས་བཟང་པོའི་སྤྱོད་ཅེས་བྱ་བ་འདི། །ཚུལ་ནི་ཁྱོད་ལ་བསྟན་པ་འདི་ཡིན་གྱིས། །དེ་ཤེས་གྱིས་ལ་དགེ་བཤེས་རང་བཞིན་གྱིས། །
en: {155} “Sudhana, this conduct that is called good, This is the way that has been taught to you.

source: བསྙེན་བཀུར་བྱེད་ཚེ་འཇུག་པར་མ་བྱེད་ཅིག །
en: Knowing it, you will naturally be serving The kalyāṇamitras; at that time, have no fear.

source: ལུས་རྣམས་བྱེ་བ་སྔན་ཅད་ཁྱོད་ཀྱིས་ཀྱང་། །འདོད་པའི་དོན་དུ་དོན་མེད་ཟད་བྱས་སོམས། །
en: {156} “Contemplate how in the past you have wasted Millions of lives meaninglessly for the sake of desires.

source: ད་ནི་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་གྱུར་ན། །
en: Now, in seeking for enlightenment, Proceed perfectly disciplined by disciplined conduct.

source: བརྟུལ་ཤུགས་བཟང་པོ་བརྟུལ་བས་ཞིག་གོ་འདང་། །ཁྱོད་ཀྱིས་བསྐལ་པ་བྱེ་བ་འདས་བྱས་ཏེ། །འདུས་བྱས་སྡུག་བསྔལ་ཐམས་ཅད་ཉམས་སུ་མྱོང་། །
en: {157} “While ten million kalpas passed by, You experienced all composite suffering.

source: གང་གཱའི་བྱེ་སྙེད་སངས་རྒྱས་མཉེས་མ་བྱས། །འདི་འདྲའི་ཚུལ་ཡང་ཐོས་པར་མ་གྱུར་ཏོ། །
en: You did not honor buddhas as numerous as the Ganges sands Or hear from them the teaching on this way.

source: དེ་ལས་ད་ནི་ཁོམ་པར་མིར་ཡང་སྐྱེས། །སངས་རྒྱས་འབྱུང་མཐོང་དགེ་བཤེས་འདི་འདྲ་སྟེ། །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་པའང་ཐོས་པར་འགྱུར། །རྣམ་དག་སེམས་སུ་ད་གོ་ཅིར་མི་འགྱུར། །
en: {158} “Now this time you have been born into an opportune human existence, Have seen the appearance of a buddha, and have heard This supreme bodhisattva conduct from these kinds of kalyāṇamitras, So why should your mind not be pure?

source: བདེ་བར་གཤེགས་པ་ཡང་དུ་འབྱུང་བར་འགྱུར། །དགེ་བཤེས་དེ་བཞིན་ཆོས་མཉན་ཐོས་པར་འགྱུར། །གལ་ཏེ་བསམ་པ་ཡོངས་སུ་མ་སྦྱངས་ན། །ཚུལ་འདི་ཕྱིན་ཆད་ཐོས་པར་དཀའ་བ་ཡིན། །
en: {159} “The sugatas can appear repeatedly And the Dharma heard from the kalyāṇamitras, But if your aspiration has not been purified, It will be difficult to hear this way.

source: དེ་བས་དད་དང་མོས་དང་བསམ་པ་རྣམས། །ཡོངས་སུ་བསྐྱེད་ལ་བླ་མ་ཕུད་དུད་གྱིས། །ཐེ་ཙོམ་ལྟ་བ་ཡོངས་སུ་སྐྱོ་སྤངས་ལ། །ཡང་དང་ཡང་དུ་འདི་འདྲ་ཚུལ་ཉོན་ཅིག །
en: {160} “Therefore, develop faith, aspiration, and motivation, And with veneration for the gurus Be weary of and reject views of doubt, And listen again and again to this way.

source: གང་གིས་སྤྱོད་ལ་འཇུག་པ་འདི་འདྲ་འདི། །ཐོས་ནས་དེ་འདྲའི་སྨོན་ལམ་མངོན་བསྒྲུབས་པ། །དེ་དག་ཐོབ་པ་དམ་པ་བསམ་མི་ཁྱབ། །དེ་དག་མི་ཡི་སྲིད་པར་ལེགས་པར་འོངས། །
en: {161} “Those who have heard this kind of entry into conduct And have accomplished that kind of prayer Will have an inconceivable, perfect attainment And will have an excellent human existence.

source: གང་གིས་དེ་འདྲའི་མོས་བ་སྦྱངས་པ་ནི། །དེ་ལ་བདེ་གཤེགས་ཐམས་ཅད་མི་དཀོན་ནོ། །
en: {162} “For the ones who purify that kind of aspiration, The sight of all the sugatas will not be rare.

source: དེ་ནི་རྒྱལ་བ་རྣམས་ཀྱི་སྲས་དང་སྤུན། །དེ་ལ་ཕྱིན་ཆད་བྱང་ཆུབ་ཐེ་ཙོམ་མེད། །
en: All jinaputras will be their kin, and henceforward He will have no doubts about enlightenment.

source: གང་ཞིག་འདི་འདྲའི་ཚུལ་འདིར་ཞུགས་གྱུར་པ། །དེས་ནི་ལོག་པར་ལྟུང་བ་ཐམས་ཅད་སྤངས། །དེས་ནི་སྡུག་བསྔལ་ཆོས་རྣམས་ཐམས་ཅད་བསྩལ། །དེས་ནི་ཡོན་ཏན་ཐམས་ཅད་བསྡུ་བ་བྱས། །
en: {163} “Those who enter this kind of way Will forsake all downfalls through error, Will eliminate all the phenomena of suffering, And will accumulate all good qualities.

source: ལུས་ནི་བོར་ནས་རིང་པོར་མི་ཐོགས་སུ། །ཡོངས་སུ་དག་པའི་སངས་རྒྱས་ཞིང་དུ་འགྲོ། །བྱང་ཆུབ་སེམས་དཔའི་གནས་སུ་འཇུག་པར་འགྱུར། །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར། །
en: {164} “When the body is abandoned, one will soon Go to a completely pure buddha realm; One will enter the dwellings of the bodhisattvas And will see the tathāgatas of the ten directions.

source: ནོར་བཟངས་ཁྱོད་ཀྱི་སྔོན་གྱི་རྒྱུ་སྡུག་པས། །ད་ལྟར་བྱུང་ལ་མོས་པ་ངེས་པ་ཡིས། །ཁྱད་པར་དོན་གཉེར་དགེ་བཤེས་བསྟེན་བྱས་པས། །ཆུ་ལས་ཨུཏ་པལ་བཞིན་དེ་ཕྱིར་འཕེལ། །
en: {165} “Sudhana, through your multitude of causes in the past, Through your definite aspiration in the present, And through your relying on kalyāṇamitras for a special purpose, You will grow like a blue lotus on the water.

source: དགེ་བཤེས་ཐམས་ཅད་ཕུ་དུད་བསམ་པ་དང་། །སངས་རྒྱས་ཐམས་ཅད་དགྱེས་བྱའི་བསམ་པ་དང་། །ཆོས་ཀུན་ཡོངས་སུ་དྲི་བའི་བསམ་པ་ཅན། །བརྟུལ་ཞུགས་བཟང་པོ་ལྡན་པ་དལ་གྱིས་ལོངས། །
en: {166} “You who have the aspiration to revere all kalyāṇamitras, You who have the aspiration to please all buddhas, You who have the aspiration to inquire about all Dharmas, You who have excellent discipline, stand up easefully.

source: ཆོས་ཀྱི་ནན་ཏན་ཀུན་ལ་རབ་གནས་པ། །ལམ་རྣམས་རྗེས་སུ་ཀུན་ཚོལ་རབ་གནས་པ། །སངས་རྒྱས་སྲས་ཀྱི་སྨོན་ལམ་རབ་གནས་པ། །ཡོན་ཏན་ཆོས་རྣམས་ཀུན་གྱི་སྣོད་ཁྱོད་ལོངས། །
en: {167} “Stand, you who are established in all practices of the Dharma, You who are established in following all paths, You who are established in the prayers of the sons of buddhas, You who are a vessel for all good qualities and the Dharma.

source: མོས་པ་ཕུན་སུམ་ཚོགས་པ་ཅི་འདྲ་བས། །ཁྱོད་ཀྱིས་ང་ལ་ཕྱག་འདི་བྱས་པ་ནི། །སངས་རྒྱས་ཐམས་ཅད་འཁོར་དུ་མངོན་སུམ་དུ། །རིང་པོར་མི་ཐོགས་ཡོངས་སུ་འབྱུང་བར་འགྱུར། །
en: {168} “Just as you have developed a perfect aspiration And you have paid homage to me, Before long you will come to be Directly before the assemblies of all buddhas.

source: སྐྱོ་བའི་ཡིད་མེད་ནོར་བཟངས་ལེགས་པ་ཡིན། །སངས་རྒྱས་ཀུན་གྱི་སྨོན་ལམ་སེམས་ལྡན་པ། །བརྟུལ་ཞུགས་བརྟན་ཁྱོད་རིང་པོར་མི་ཐོགས་པར། །སངས་རྒྱས་ཀུན་གྱི་ཡོན་ཏན་མཐར་ཕྱིན་འགྱུར། །
en: {169} “Well done, Sudhana, you who have an untiring mind, Who have the motivation of the prayers of all the buddhas; You who have firm discipline, you will before long Perfectly accomplish the qualities of all buddhas.

source: ཡེ་ཤེས་སྤྱོད་ཡུལ་རྣམ་པར་མཐར་ཕྱིན་པའི། །འཇམ་དཔལ་གན་དུ་ནོར་བཟངས་ཁྱོད་སོང་སྟེ། །བཟང་པོ་སྤྱོད་པ་དམ་པ་མཆོག་དྲིས་ཤིག །དེ་ཚུལ་ཁྱོད་འཇུག་དེ་ནས་བྱེད་པར་འགྱུར། །
en: {170} “Sudhana, go into the presence of Mañjuśrī, Who has fully attained the field of activity of wisdom, And ask him about the supreme, excellent good conduct, And then you will enter that way and practice it.”

source: དེ་ལྟར་བྱམས་པ་ཆགས་མེད་སྤྱོད་ཡུལ་གྱིས། །ནོར་བཟངས་ཡང་དག་ལེགས་པས་འཕགས་མཐོང་ནས། །
en: {171} In that way, Maitreya, who has an unimpeded field of activity, Saw Sudhana, who was superior through his excellent qualities.

source: འཁོར་རྣམས་ཀུན་ལ་མངོན་པར་བསྟན་བྱས་ཏེ། །དེ་ཡི་ཡོན་ཏན་ལེགས་མཛོད་འདི་བརྗོད་དོ། །
en: He then showed him to his entire assembly of followers And described this excellent treasury of his qualities.

source: འདི་འདྲའི་རྗེས་སུ་བསྟན་པ་དམ་པ་དང་། །གདམས་ངག་དེ་འདྲ་ནོར་བཟངས་ཐོས་གྱུར་ནས། །དགའ་བའི་ཤུགས་ཀྱིས་དབང་པོ་མངོན་བརླན་པས། །མཆི་མའི་རྒྱུད་མང་རབ་ཏུ་དེས་ཀྱང་བླགས། །
en: {172} When Sudhana had heard such instructions And such a sublime teaching as this, His senses were saturated by the power of joy, And he streamed with a flow of many tears.

source: དགའ་བའི་ཉམས་ཆེན་ཉམས་སུ་མྱོང་བར་འགྱུར། །དབང་པོ་ཚིམ་ནས་ཤུགས་ཀྱིས་དབུགས་ཀྱང་ཕྱུང་། །
en: {173} There arose a great experience of joy, His senses were satisfied, and he was spontaneously relieved.

source: ནོར་བཟངས་ལངས་ཏེ་ཐལ་མོ་རབ་སྦྱར་ནས། །བྱམས་པ་དེ་ལ་བསྐོར་བ་རབ་ཏུ་བྱས། །
en: Sudhana stood up with his palms pressed together, And he performed circumambulations around Maitreya.

source: དེ་ཡི་ལག་ཏུ་འཇམ་དཔལ་སེམས་དབང་གིས། །མེ་ཏོག་ཕྲེང་བ་རིན་ཆེན་མཛེས་པ་དག །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་པས་མངོན་འཐོན་པ། །ཡིད་དུ་འོང་བ་མང་པོ་བྱུང་བར་གྱུར། །
en: {174} Through the power of Mañjuśrī there appeared A precious garland of flowers in Sudhana’s hands, And there appeared many kinds of delights, Which were arising from bodhisattva prayers.

source: ནོར་བཟངས་དེ་ཚེ་རབ་ཏུ་དགའ་གྱུར་ནས། །དགའ་བར་དེ་དག་བྱམས་པ་དེ་ལ་གཏོར། །
en: {175} At that time, Sudhana was filled with joy, And he joyfully scattered them toward Maitreya.

source: དེ་ཚེ་དེ་ཡི་མགོ་ལ་ཀུན་ནས་བྱུགས། །བྱམས་པས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས། །རྒྱལ་བའི་སྲས་པོ་ནོར་བཟངས་ལེགས་སོ་ལེགས། །
en: At that time, Maitreya stroked his head, And then he recited this verse: {176} “Well done, well done, Jinaputra Sudhana.

source: དེ་ལྟར་ཁྱོད་ནི་ཡོངས་སུ་མི་སྐྱོ་བས། །
en: In that manner you remain unwearied.

source: ང་དང་འཇམ་དཔལ་ཅི་འདྲ་ཅི་བཞིན་དུ། །ཡོན་ཏན་སྣོད་དུ་ཁྱོད་ནི་མྱུར་དེ་འགྱུར། །
en: You will quickly become a vessel for qualities So that you will be just like me and Mañjuśrī.”

source: ཐོས་ནས་ནོར་བཟངས་དགའ་བའི་ཚིག་བརྗོད་པ། །འདི་འདྲའི་དགེ་བཤེས་བདག་དང་ཕྲད་པ་ནི། །སྲིད་པ་བརྒྱ་ཕྲག་འགྲངས་པར་ཤིན་ཏུ་དཀོན། །
en: {177} When he heard that, Sudhana, filled with joy, recited, “My meeting this kind of kalyāṇamitra Would be a rare event even in hundreds of lives!

source: བདག་གིས་དེ་རིང་འདིར་ཕྱིན་ཤིན་ཏུ་ལེགས། །
en: It is excellent that I have come here today!

source: ཡོན་ཏན་ཀུན་གྱི་ཕ་རོལ་ཕྱིན་གྱུར་པ། །འཇམ་དཔལ་ཁྱོད་ཀྱི་བྱིན་རླབས་བཟང་པོ་ཡིས། །བདག་གིས་བཤེས་གཉེན་འདི་དག་དཀོན་པ་རྙེད། །
en: {178} “Through your excellent blessing, Mañjuśrī, You who have attained the perfection of all qualities, I have found these rare kalyāṇamitras.

source: ཁྱོད་དང་བདག་ཏུ་མྱུར་དུ་འགྲོགས་པར་རོ།། །།
en: May I soon be together with you!”

source: སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་བཅུ་དགུ་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ན་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: {179} Then Sudhana, the head merchant’s son, stood before the bodhisattva mahāsattva Maitreya with his palms together in homage and said, “Ārya, I have set out upon the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ། འཕགས་པ་བྱམས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་སྟེ།
en: “Ārya Maitreya, you have been prophesied by all the tathāgatas to be only one lifetime from the highest, complete enlightenment.

source: གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྐུ་ཚེ་གཅིག་གིས་ཐོགས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འགོད་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ལགས།
en: “Those who are only one lifetime from the highest, complete enlightenment have transcended all the established states of bodhisattvas.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་རབ་ཏུ་ཞུགས་པ་ལགས།
en: They have entered the faultlessness of bodhisattvas.

source: དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ལགས།
en: They have completed all the perfections.

source: དེ་ནི་བཟོད་པའི་སྒོ་ཐམས་ཅད་དུ་ཞུགས་པ་ལགས།
en: They have entered all the gateways to patience.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་རབ་ཏུ་བརྙེས་པ་ལགས།
en: They have attained all the bodhisattva bhūmis.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྒོ་ཐམས་ཅད་ལ་རྣམ་པར་རོལ་པ་ལགས།
en: They delight in all the entrances to the bodhisattva liberations.

source: དེས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབས་པ་ལགས། །
en: They have accomplished all samādhis.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྒྱུད་ཐམས་ཅད་རྟོགས་པར་ཐུགས་སུ་ཆུད་པ་ལགས།
en: They have realized all the states of existence of bodhisattvas.

source: དེས་ནི་གཟུངས་དང་སྤོབས་པ་སྣང་བའི་ཚུལ་ཐམས་ཅད་ལ་རབ་ཏུ་བརྙེས་པ་ལགས། །
en: They have attained all the ways of the light of retention and eloquence.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ལ་མངའ་ཐོབ་པ་ལགས།
en: They have gained all the powers of bodhisattvas.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཤིན་ཏུ་བསྩགས་པ་ལགས།
en: They have gathered all the accumulations of bodhisattvas.

source: དེས་ནི་ཤེས་རབ་དང་ཐབས་མཁས་པའི་ཚུལ་ལ་རྣམ་པར་རོལ་པ་ལགས།
en: They delight in the ways of skill in wisdom and methods.

source: དེས་ནི་མངོན་པར་ཤེས་པ་ཆེན་པོ་དང་། རིག་པ་དང་ཡེ་ཤེས་སྣང་བའི་ཚུལ་བསྐྱེད་པ་ལགས།
en: They have developed the ways of the light of great higher cognition, knowledge, and wisdom.

source: དེ་ནི་བསླབ་པ་ཐམས་ཅད་ལས་བྱུང་བ་ལགས།
en: They have come forth from all trainings.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྦྱངས་པ་ལགས།
en: They have purified all bodhisattva conduct.

source: དེས་ནི་སྨོན་ལམ་གྱིས་འབྱུང་བའི་སྒོ་ཐམས་ཅད་མངོན་པར་བསྒྲུབས་པ་ལགས།
en: They have accomplished all the gateways that arise from prayer.

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ལུང་བསྟན་པ་རབ་ཏུ་བླངས་པ་ལགས།
en: They have obtained the prophecies of all tathāgatas.

source: དེ་ནི་ཐེག་པ་ཐམས་ཅད་ཀྱིས་འབྱུང་བའི་སྒོ་ལ་མཁས་པ་ལགས།
en: They are skilled in the gateways that arise from all yānas.

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཡང་དག་པར་བླངས་པ་ལགས།
en: They have obtained the blessing of all the tathāgatas.

source: དེས་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་བཟུང་བ་ལགས།
en: They have grasped the enlightenment of all the buddhas.

source: དེས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་མཛོད་བཟུང་བ་ལགས།
en: They have gained the Dharma treasure of all the tathāgatas.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་མཛོད་འཛིན་པ་ལགས།
en: They possess the treasure of the secrets of all the tathāgatas.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་སྤྱི་བོར་ཕྱིན་པ་ལགས།
en: They are the heads of all the secret fields of all bodhisattvas.

source: དེ་ནི་ཉོན་མོངས་པའི་དཔུང་ཐམས་ཅད་རྣམ་པར་དཀྲུགས་པ་ལ་ཤིན་ཏུ་དཔའ་བ་ལགས།
en: They are heroes who alarm all the hosts of the kleśas.

source: དེ་ནི་འཁོར་བའི་འབྲོག་དགོན་པར་ལུས་པ་རྣམས་ཀྱི་ལམ་སྟོན་པ་ལགས།
en: They are the guides for those lost in the wilderness of saṃsāra.

source: དེ་ནི་ཉོན་མོངས་པའི་ནད་ཀྱིས་ཐེབས་པ་རྣམས་ཀྱི་སྨན་པར་གྱུར་པ་ལགས།
en: They are physicians for those afflicted by the illness of the kleśas.

source: དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕུལ་དུ་ཕྱིན་པ་ལགས།
en: They are supreme among all beings.

source: དེ་ནི་འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱི་དབང་པོ་ལགས།
en: They are lords of all lords of the world.

source: དེ་ནི་འཕགས་པའི་གང་ཟག་ཐམས་ཅད་ཀྱི་ཐུ་བོ་ལགས།
en: They are the most senior among all ārya individuals.

source: དེ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ལགས།
en: They are the chief of all śrāvakas and pratyeka­buddhas.

source: དེ་ནི་འཁོར་བའི་རྒྱ་མཚོ་ལ་རྒྱུ་བ་རྣམས་ཀྱི་སྐྱབས་འཛིན་པ་ལགས།
en: They are the sea captains for those who are in the ocean of saṃsāra.

source: དེས་ནི་སེམས་ཅན་གདུལ་བའི་ཐབས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་བཤལ་བ་ལགས།
en: They wash others with the great ocean of methods of guiding beings.
